#Задача№1
#  - Напишите программу, которая принимает на вход 
#  вещественное число и показывает сумму его цифр.

# *Пример:*

# - 6782 -> 23
# - 0,56 -> 11

num = float(input("Введите вещественное число: "))

def sum_num ():
    n = abs(n)
    sum  = 0
    for i in n:
        '.' == == '.' : continue
        sum +=int (i)
    return sum
print(sum)