# Урок 7. Python: от простого к практике
# Задание в группах: Создать телефонный справочник 
# с возможностью импорта и экспорта данных в нескольких форматах.

# Заметьте: не просто импорт и экспорт, а телефонный 
# справочник с возможностью импорта и экспорта. 
# Формат - это csv файл с разным разделителем, txt, json
# Фамилия_1
# Имя_1
# Телефон_1
# Описание_1

# Фамилия_2
# Имя_2
# Телефон_2
# Описание_2

# или
# Фамилия_1;Имя_1;Телефон_1;Описание_1
# или
# Фамилия_1,Имя_1,Телефон_1,Описание_1


