# name = "Эльмира"
# age = 22
# print("Меня зовут..." + name)

# # Добавить str так как нельзя писать все висете и int и str!
# print("Меня зовут..." + name + "  Мне  " + str(age) + "  года  ")
# # Экранирование
# print("Он \"красивый\" человек")
# # или
# print('Он "красивый" человек')

# # Перевод строки
# print('Привет, \nМИР')
# # или
# print('Привет, ')
# print('МИР')

# # Функция input
# # Чтобы не ввел пользователь Это всегда будет опр-ся как СТРОКА!!!

# # name = input("Как Вас зовут : ")
# # age = input("Укажите свой возраст  ")

# # print(" Привет " + name + " ! ")
# # print(" Тебе уже " + age + " года ")  # Перевод типа данных не требуется

# # Арифметические операции

# a = 21
# b = 4
# c = a**b
# print("Ответ = ", c)

# c = a+b
# print("Ответ = ", c)

# c = a % b
# print("Ответ = ", c)

# # Унарный минус
# с = 13
# c = -с
# c = -с
# print("Ответ = ", c)
# print("Ответ = ", c)

# Округление функция round

а = 5.65
print(round(c))
